Monard2033/nRF52840-Transmitter/src/main.c
/*
 * Copyright (c) 2024 Monard2033
 * SPDX-License-Identifier: Apache-2.0
 *
 * Wireless keyboard transmitter:
 *   8-byte SPI slave keyboard report -> reliable ESB PTX packet.
 */

#include <errno.h>
#include <string.h>

#include <esb.h>
#include <nrfx.h>
#include <zephyr/device.h>
#include <zephyr/drivers/spi.h>
#include <zephyr/kernel.h>
#include <zephyr/logging/log.h>
#include <zephyr/sys/atomic.h>
#include <zephyr/sys/util.h>
#include <zephyr/usb/usb_device.h>

LOG_MODULE_REGISTER(transmitter, LOG_LEVEL_INF);

#define KEYBOARD_REPORT_SIZE    8U
#define LINK_MAGIC              0xA5U
#define LINK_VERSION            0x01U
#define LINK_TYPE_KEYBOARD      0x01U
#define LINK_RF_CHANNEL         80U
#define REPORT_QUEUE_DEPTH      32U
#define REPORT_KEEPALIVE_MS     8
#define APP_TX_RETRY_COUNT      0U
#define ESB_EVENT_TIMEOUT_US    2000

struct link_keyboard_packet {
	uint8_t magic;
	uint8_t version;
	uint8_t type;
	uint8_t sequence;
	uint8_t report[KEYBOARD_REPORT_SIZE];
} __packed;

struct keyboard_report {
	uint8_t data[KEYBOARD_REPORT_SIZE];
};

BUILD_ASSERT(sizeof(struct link_keyboard_packet) == 12U);

static const struct device *const spi_device =
	DEVICE_DT_GET(DT_NODELABEL(spi1));

static const struct spi_config spi_config = {
	.frequency = 8000000U,
	.operation = SPI_OP_MODE_SLAVE | SPI_WORD_SET(8) | SPI_TRANSFER_MSB,
	.slave = 0,
};

K_MSGQ_DEFINE(report_queue, sizeof(struct keyboard_report),
	      REPORT_QUEUE_DEPTH, sizeof(uint32_t));
static K_SEM_DEFINE(esb_tx_done, 0, 1);
static K_SEM_DEFINE(esb_started, 0, 1);

static struct esb_config esb_config = ESB_DEFAULT_CONFIG;
static struct esb_payload esb_tx_payload;
static atomic_t esb_last_tx_succeeded;

static atomic_t spi_frames;
static atomic_t spi_errors;
static atomic_t report_queue_overruns;
static atomic_t esb_tx_successes;
static atomic_t esb_tx_failures;
static atomic_t esb_tx_timeouts;
static atomic_t esb_link_probes;

static void transmitter_esb_event_handler(const struct esb_evt *event)
{
	switch (event->evt_id) {
	case ESB_EVENT_TX_SUCCESS:
		atomic_set(&esb_last_tx_succeeded, 1);
		atomic_inc(&esb_tx_successes);
		k_sem_give(&esb_tx_done);
		break;
	case ESB_EVENT_TX_FAILED:
		atomic_set(&esb_last_tx_succeeded, 0);
		atomic_inc(&esb_tx_failures);
		k_sem_give(&esb_tx_done);
		break;
	case ESB_EVENT_RX_RECEIVED:
		/* This application does not use acknowledgement payloads. */
		break;
	default:
		break;
	}
}

static int esb_initialize(void)
{
	static const uint8_t base_address_0[4] = {
		0xE7, 0xE7, 0xE7, 0xE7
	};
	static const uint8_t base_address_1[4] = {
		0xC2, 0xC2, 0xC2, 0xC2
	};
	static const uint8_t address_prefixes[8] = {
		0xE7, 0xC2, 0xC3, 0xC4, 0xC5, 0xC6, 0xC7, 0xC8
	};
	int err;

	esb_config.protocol = ESB_PROTOCOL_ESB_DPL;
	esb_config.mode = ESB_MODE_PTX;
	esb_config.bitrate = ESB_BITRATE_2MBPS;
	esb_config.tx_output_power = ESB_TX_POWER_8DBM;
	esb_config.retransmit_delay = 450;
	esb_config.retransmit_count = 1;
	esb_config.payload_length = sizeof(struct link_keyboard_packet);
	esb_config.selective_auto_ack = true;
	esb_config.use_fast_ramp_up = true;
	esb_config.event_handler = transmitter_esb_event_handler;

	err = esb_init(&esb_config);
	if (err != 0) {
		return err;
	}

	err = esb_set_base_address_0(base_address_0);
	if (err != 0) {
		return err;
	}

	err = esb_set_base_address_1(base_address_1);
	if (err != 0) {
		return err;
	}

	err = esb_set_prefixes(address_prefixes, ARRAY_SIZE(address_prefixes));
	if (err != 0) {
		return err;
	}

	return esb_set_rf_channel(LINK_RF_CHANNEL);
}

static void queue_report(const uint8_t report[KEYBOARD_REPORT_SIZE])
{
	struct keyboard_report item;

	memcpy(item.data, report, sizeof(item.data));
	if (k_msgq_put(&report_queue, &item, K_NO_WAIT) == 0) {
		return;
	}

	/*
	 * Reports are complete keyboard states. When saturated, replacing the
	 * oldest state with the newest gives the receiver the state that matters
	 * and prevents a release from being stuck behind stale reports.
	 */
	struct keyboard_report discarded;

	atomic_inc(&report_queue_overruns);
	if (k_msgq_get(&report_queue, &discarded, K_NO_WAIT) == 0) {
		(void)k_msgq_put(&report_queue, &item, K_NO_WAIT);
	}
}

static int esb_send_report(const struct keyboard_report *report)
{
	static uint8_t sequence;
	struct link_keyboard_packet packet = {
		.magic = LINK_MAGIC,
		.version = LINK_VERSION,
		.type = LINK_TYPE_KEYBOARD,
		.sequence = sequence++,
	};
	int err = -EIO;

	memcpy(packet.report, report->data, sizeof(packet.report));

	esb_tx_payload.length = sizeof(packet);
	esb_tx_payload.pipe = 0;
	esb_tx_payload.noack = false;
	memcpy(esb_tx_payload.data, &packet, sizeof(packet));

	for (uint32_t attempt = 0; attempt <= APP_TX_RETRY_COUNT; ++attempt) {
		k_sem_reset(&esb_tx_done);
		atomic_set(&esb_last_tx_succeeded, 0);
		esb_flush_tx();

		err = esb_write_payload(&esb_tx_payload);
		if (err != 0) {
			LOG_WRN("ESB queue failed: %d", err);
			continue;
		}

		err = k_sem_take(&esb_tx_done, K_USEC(ESB_EVENT_TIMEOUT_US));
		if (err != 0) {
			atomic_inc(&esb_tx_timeouts);
			LOG_ERR("ESB event timeout");
			esb_flush_tx();
			return -ETIMEDOUT;
		}

		if (atomic_get(&esb_last_tx_succeeded) != 0) {
			return 0;
		}

		err = -EIO;
	}

	return err;
}

static void radio_thread(void)
{
	struct keyboard_report report = { 0 };
	bool report_valid = false;

	k_sem_take(&esb_started, K_FOREVER);
	for (;;) {
		/*
		 * Never synthesize an all-keys-released report while SPI is idle:
		 * that used to release a held key after one second. Instead, repeat
		 * the latest complete state as a recovery keepalive.
		 */
		if (!report_valid) {
			k_msgq_get(&report_queue, &report, K_FOREVER);
			report_valid = true;
		} else if (k_msgq_get(&report_queue, &report,
				      K_MSEC(REPORT_KEEPALIVE_MS)) != 0) {
			atomic_inc(&esb_link_probes);
		}

		if (esb_send_report(&report) != 0) {
			LOG_WRN_RATELIMIT("Report was not acknowledged");
		}
	}
}

K_THREAD_DEFINE(radio_thread_id, 1536, radio_thread,
		NULL, NULL, NULL, 5, 0, 0);

static void status_thread(void)
{
	for (;;) {
		k_sleep(K_SECONDS(5));
		LOG_INF("SPI=%ld err=%ld queue_drop=%ld keepalive=%ld ESB_ok=%ld fail=%ld "
			"timeout=%ld RF[state=%lu cfg_ch=%u reg_ch=%lu mode=%lu txpipe=%lu] "
			"HF=0x%08lx",
			(long)atomic_get(&spi_frames),
			(long)atomic_get(&spi_errors),
			(long)atomic_get(&report_queue_overruns),
			(long)atomic_get(&esb_link_probes),
			(long)atomic_get(&esb_tx_successes),
			(long)atomic_get(&esb_tx_failures),
			(long)atomic_get(&esb_tx_timeouts),
			(unsigned long)NRF_RADIO->STATE,
			LINK_RF_CHANNEL,
			(unsigned long)NRF_RADIO->FREQUENCY,
			(unsigned long)NRF_RADIO->MODE,
			(unsigned long)NRF_RADIO->TXADDRESS,
			(unsigned long)NRF_CLOCK->HFCLKSTAT);
	}
}

K_THREAD_DEFINE(status_thread_id, 1024, status_thread,
		NULL, NULL, NULL, 7, 0, 0);

int main(void)
{
	uint8_t spi_rx[KEYBOARD_REPORT_SIZE] __aligned(sizeof(uint32_t));
	uint8_t previous_report[KEYBOARD_REPORT_SIZE] = { 0 };
	int64_t previous_queue_time = 0;
	bool previous_report_valid = false;
	int err;

	LOG_INF("Starting SPI-to-ESB keyboard transmitter");

	err = usb_enable(NULL);
	if (err != 0) {
		LOG_ERR("USB CDC initialization failed: %d", err);
		return err;
	}

	if (!device_is_ready(spi_device)) {
		LOG_ERR("SPI slave device is not ready");
		return -ENODEV;
	}

	err = esb_initialize();
	if (err != 0) {
		LOG_ERR("ESB initialization failed: %d", err);
		return err;
	}
	k_sem_give(&esb_started);

	LOG_INF("Ready: SPI slave on %s at 8 MHz, ESB PTX 2 Mbps channel %u, "
		"pipe 0 address E7:E7E7E7E7",
		spi_device->name, LINK_RF_CHANNEL);

	for (;;) {
		struct spi_buf rx_buffer = {
			.buf = spi_rx,
			.len = sizeof(spi_rx),
		};
		const struct spi_buf_set rx = {
			.buffers = &rx_buffer,
			.count = 1,
		};

		memset(spi_rx, 0, sizeof(spi_rx));
		err = spi_transceive(spi_device, &spi_config, NULL, &rx);
		if (err < 0) {
			atomic_inc(&spi_errors);
			LOG_ERR("SPI slave transfer failed: %d", err);
			k_msleep(1);
			continue;
		}

		/*
		 * In Zephyr slave mode, the positive return value is the number
		 * of received 8-bit frames. Reject short chip-select windows.
		 */
		if (err != KEYBOARD_REPORT_SIZE) {
			atomic_inc(&spi_errors);
			LOG_WRN("Ignoring short SPI report: %d/8 bytes", err);
			continue;
		}

		atomic_inc(&spi_frames);

		const int64_t now = k_uptime_get();
		const bool changed =
			!previous_report_valid ||
			memcmp(spi_rx, previous_report, sizeof(spi_rx)) != 0;
		const bool keepalive_due =
			(now - previous_queue_time) >= REPORT_KEEPALIVE_MS;

		if (changed || keepalive_due) {
			queue_report(spi_rx);
			memcpy(previous_report, spi_rx, sizeof(previous_report));
			previous_report_valid = true;
			previous_queue_time = now;
		}
	}
}
